# Data Science Pandas

## Tasks Today:

0) <b>Pre-Work</b> <br>
 &nbsp;&nbsp;&nbsp;&nbsp; a) Numpy Random Sampling

1) <b>Pandas</b> <br>
 &nbsp;&nbsp;&nbsp;&nbsp; a) Importing <br>
 &nbsp;&nbsp;&nbsp;&nbsp; b) Tabular Data Structures <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - from_dict() <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - read_csv() <br>
 &nbsp;&nbsp;&nbsp;&nbsp; c) <b>In-Class Exercise #1</b> <br>
 &nbsp;&nbsp;&nbsp;&nbsp; d) Accessing Data <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - Indexing <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - df.loc <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - keys() <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - Slicing a DataFrame <br>
 &nbsp;&nbsp;&nbsp;&nbsp; e) Built-In Methods <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - head() <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - tail() <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - shape <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - describe() <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - sort_values() <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - .columns <br>
 &nbsp;&nbsp;&nbsp;&nbsp; f) <b>In-Class Exercise #2</b> <br>
 &nbsp;&nbsp;&nbsp;&nbsp; g) Filtration <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - Conditionals <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - Subsetting <br>
 &nbsp;&nbsp;&nbsp;&nbsp; h) Column Transformations <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - Generating a New Column w/Data <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - User Defined Function <br>
 &nbsp;&nbsp;&nbsp;&nbsp; i) Aggregations <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - groupby() <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - Type of groupby() <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - mean() <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - groupby() w/Multiple Columns <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - drop_duplicates() <br>

## Numpy Random Sampling

In [1]:
import numpy as np

## Pandas <br>

<p>Pandas is a flexible data analysis library built on top of NumPy that is excellent for working with tabular data. It is currently the de-facto standard for Python-based data analysis, and fluency in Pandas will do wonders for your productivity and frankly your resume. It is one of the fastest ways of getting from zero to answer in existence. </p>

<ul>
    <li>Pandas is a Python module, written in C. The Pandas module is a high performance, highly efficient, and high level data analysis library. It allows us to work with large sets of data called dataframes.</li>
    <li>Series is a one-dimensional labeled array capable of holding data of any type (integer, string, float, python objects, etc.)</li>
    <li>Dataframe = Spreadsheet (has column headers, index, etc.)</li>
</ul>

### Importing

In [2]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\zaur\anaconda3\lib\site-packages (1.4.4)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\zaur\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: numpy>=1.18.5 in c:\users\zaur\anaconda3\lib\site-packages (from pandas) (1.21.5)
Requirement already satisfied: pytz>=2020.1 in c:\users\zaur\anaconda3\lib\site-packages (from pandas) (2022.1)
Requirement already satisfied: six>=1.5 in c:\users\zaur\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [2]:
import pandas as pd

# always use pd, standard for data science

### Tabular data structures <br>
<p>The central object of study in Pandas is the DataFrame, which is a tabular data structure with rows and columns like an excel spreadsheet. The first point of discussion is the creation of dataframes both from native Python dictionaries, and text files through the Pandas I/O system.</p>

In [3]:



data = {
    'Name': ['Nazrin', 'Jafar', 'Jane'],
    'Age': [25, 30, 35],
    'City': ['San Jose', 'Los Angeles', 'San Diego']
}


df = pd.DataFrame(data)

print(df)

     Name  Age         City
0  Nazrin   25     San Jose
1   Jafar   30  Los Angeles
2    Jane   35    San Diego

##### from_dict()

<p>Let's convert our not-so-useful-for-analysis dict into a Pandas dataframe. We can use the from_dict function to do this easily using Pandas:</p>

In [4]:
pd.DataFrame.from_dict(data, orient='columns', dtype=None, columns=None)

     Name  Age         City
0  Nazrin   25     San Jose
1   Jafar   30  Los Angeles
2    Jane   35    San Diego

##### read_csv()

In [5]:
file_path = 'C:\\Users\\Zaur\\Downloads\\boston_marathon2017_edited - boston_marathon2017_edited.csv'

### In-Class Exercise #1 - Read in Boston Red Sox Hitting Data <br>
<p>Use the pandas read_csv() method to read in the statistics from the two files yesterday.</p>

In [6]:
file_path = 'C:\\Users\\Zaur\\Downloads\\boston_marathon2017_edited - boston_marathon2017_edited.csv'

df = pd.read_csv(file_path)

print(df.head())

                      10K                     15K                    20K  \
0  12/30/1899 12:30:28 AM  12/30/1899 12:45:44 AM  12/30/1899 1:01:15 AM
1  12/30/1899 12:30:27 AM  12/30/1899 12:45:44 AM  12/30/1899 1:01:15 AM
2  12/30/1899 12:30:29 AM  12/30/1899 12:45:44 AM  12/30/1899 1:01:16 AM
3  12/30/1899 12:30:29 AM  12/30/1899 12:45:44 AM  12/30/1899 1:01:19 AM
4  12/30/1899 12:30:28 AM  12/30/1899 12:45:44 AM  12/30/1899 1:01:15 AM

                     25K                    30K                    35K  \
0  12/30/1899 1:16:59 AM  12/30/1899 1:33:01 AM  12/30/1899 1:48:19 AM
1  12/30/1899 1:16:59 AM  12/30/1899 1:33:01 AM  12/30/1899 1:48:19 AM
2  12/30/1899 1:17:00 AM  12/30/1899 1:33:01 AM  12/30/1899 1:48:31 AM
3  12/30/1899 1:17:00 AM  12/30/1899 1:33:01 AM  12/30/1899 1:48:58 AM
4  12/30/1899 1:16:59 AM  12/30/1899 1:33:01 AM  12/30/1899 1:48:41 AM

                     40K                      5K  Age   Bib  ...  Division  \
0  12/30/1899 2:02:53 AM  12/30/1899 12:15:25 AM   24  11.0  ...         1
1  12/30/1899 2:03:14 AM  12/30/1899 12:15:24 AM   30  17.0  ...         2
2  12/30/1899 2:03:38 AM  12/30/1899 12:15:25 AM   25  23.0  ...         3
3  12/30/1899 2:04:35 AM  12/30/1899 12:15:25 AM   32  21.0  ...         4
4  12/30/1899 2:05:00 AM  12/30/1899 12:15:25 AM   31   9.0  ...         5

  Gender                   Half  M/F              Name Number of Records  \
0      1  12/30/1899 1:04:35 AM    M   Kirui, Geoffrey                 1
1      2  12/30/1899 1:04:35 AM    M       Rupp, Galen                 1
2      3  12/30/1899 1:04:36 AM    M     Osako, Suguru                 1
3      4  12/30/1899 1:04:45 AM    M  Biwott, Shadrack                 1
4      5  12/30/1899 1:04:35 AM    M    Chebet, Wilson                 1

           Official Time  Overall                    Pace State
0  12/30/1899 2:09:37 AM        1  12/30/1899 12:04:57 AM   NaN
1  12/30/1899 2:09:58 AM        2  12/30/1899 12:04:58 AM    OR
2  12/30/1899 2:10:28 AM        3  12/30/1899 12:04:59 AM   NaN
3  12/30/1899 2:12:08 AM        4  12/30/1899 12:05:03 AM    CA
4  12/30/1899 2:12:35 AM        5  12/30/1899 12:05:04 AM   NaN

[5 rows x 26 columns]

### Accessing Data <br>

##### Indexing

<p>You can directly select a column of a dataframe just like you would a dict. The result is a Pandas 'Series' object.</p>

In [22]:
column_names = df.columns
print(column_names)
column_10K=df['10K']
print(column_10K)

Index(['10K', '15K', '20K', '25K', '30K', '35K', '40K', '5K', 'Age', 'Bib',
       'Overall Time in Seconds', 'Citizenship', 'Male Average Times',
       'Females Average Times', 'City', 'Country', 'Division', 'Gender',
       'Half', 'M/F', 'Name', 'Number of Records', 'Official Time', 'Overall',
       'Pace', 'State'],
      dtype='object')
0        12/30/1899 12:30:28 AM
1        12/30/1899 12:30:27 AM
2        12/30/1899 12:30:29 AM
3        12/30/1899 12:30:29 AM
4        12/30/1899 12:30:28 AM
                  ...
26405     12/30/1899 1:35:41 AM
26406     12/30/1899 1:05:33 AM
26407     12/30/1899 1:43:36 AM
26408     12/30/1899 1:27:19 AM
26409     12/30/1899 1:17:12 AM
Name: 10K, Length: 26410, dtype: object

##### df.loc

<p>Along the horizontal dimension, rows of Pandas DataFrames are Row objects. You will notice there is a third column present in the DataFrame - this is the $\textit{index}$. It is automatically generated as a row number, but can be reassigned to a column of your choice using the DataFrame.set_index(colname) method. We can use it to access particular Pandas $\textit{rows}$, which are also Series objects:</p>

In [30]:
row=df.loc[1]
print(row)

10K                        12/30/1899 12:30:27 AM
15K                        12/30/1899 12:45:44 AM
20K                         12/30/1899 1:01:15 AM
25K                         12/30/1899 1:16:59 AM
30K                         12/30/1899 1:33:01 AM
35K                         12/30/1899 1:48:19 AM
40K                         12/30/1899 2:03:14 AM
5K                         12/30/1899 12:15:24 AM
Age                                            30
Bib                                          17.0
Overall Time in Seconds                      7798
Citizenship                                   USA
Male Average Times                         7798.0
Females Average Times                         NaN
City                                     Portland
Country                                       USA
Division                                        2
Gender                                          2
Half                        12/30/1899 1:04:35 AM
M/F                                             M
Name                                  Rupp, Galen
Number of Records                               1
Official Time               12/30/1899 2:09:58 AM
Overall                                         2
Pace                       12/30/1899 12:04:58 AM
State                                          OR
Name: 1, dtype: object

##### keys()

In [32]:
# Access all of the keys/columns of the dataframe
# Dataframe.keys()
df.keys()

Index(['10K', '15K', '20K', '25K', '30K', '35K', '40K', '5K', 'Age', 'Bib',
       'Overall Time in Seconds', 'Citizenship', 'Male Average Times',
       'Females Average Times', 'City', 'Country', 'Division', 'Gender',
       'Half', 'M/F', 'Name', 'Number of Records', 'Official Time', 'Overall',
       'Pace', 'State'],
      dtype='object')

##### Slicing a DataFrame

In [39]:
# printing all data for context
slice_rows=df.loc['2':'7']
print(slice_rows)

                          10K                    15K                    20K  \
20000  12/30/1899 12:53:41 AM  12/30/1899 1:22:43 AM  12/30/1899 1:55:26 AM
20001  12/30/1899 12:55:58 AM  12/30/1899 1:22:10 AM  12/30/1899 1:48:40 AM
20002  12/30/1899 12:54:22 AM  12/30/1899 1:22:06 AM  12/30/1899 1:53:56 AM
20003  12/30/1899 12:54:46 AM  12/30/1899 1:25:47 AM  12/30/1899 1:56:18 AM
20004  12/30/1899 12:54:07 AM  12/30/1899 1:21:14 AM  12/30/1899 1:48:46 AM
...                       ...                    ...                    ...
26405   12/30/1899 1:35:41 AM  12/30/1899 2:23:35 AM  12/30/1899 3:12:44 AM
26406   12/30/1899 1:05:33 AM  12/30/1899 1:52:17 AM  12/30/1899 2:49:41 AM
26407   12/30/1899 1:43:36 AM  12/30/1899 2:32:36 AM                    NaN
26408   12/30/1899 1:27:19 AM  12/30/1899 2:17:17 AM  12/30/1899 3:11:40 AM
26409   12/30/1899 1:17:12 AM  12/30/1899 2:00:10 AM  12/30/1899 2:58:55 AM

                         25K                    30K                    35K  \
20000  12/30/1899 2:27:02 AM  12/30/1899 3:00:58 AM  12/30/1899 3:34:58 AM
20001  12/30/1899 2:16:21 AM  12/30/1899 2:50:59 AM  12/30/1899 3:28:41 AM
20002  12/30/1899 2:27:12 AM  12/30/1899 2:59:44 AM  12/30/1899 3:35:10 AM
20003  12/30/1899 2:30:30 AM  12/30/1899 3:03:40 AM  12/30/1899 3:36:20 AM
20004  12/30/1899 2:16:29 AM  12/30/1899 2:46:38 AM  12/30/1899 3:23:41 AM
...                      ...                    ...                    ...
26405  12/30/1899 4:12:06 AM  12/30/1899 5:03:08 AM  12/30/1899 5:55:18 AM
26406  12/30/1899 3:50:19 AM  12/30/1899 4:50:01 AM  12/30/1899 5:53:48 AM
26407  12/30/1899 4:15:21 AM  12/30/1899 5:06:37 AM  12/30/1899 6:00:33 AM
26408  12/30/1899 4:06:10 AM  12/30/1899 5:07:09 AM  12/30/1899 6:06:07 AM
26409  12/30/1899 4:27:14 AM  12/30/1899 5:37:13 AM  12/30/1899 6:39:07 AM

                         40K                      5K  Age      Bib  ...  \
20000  12/30/1899 4:07:35 AM  12/30/1899 12:26:10 AM   55  20705.0  ...
20001  12/30/1899 4:06:39 AM  12/30/1899 12:29:23 AM   28  29849.0  ...
20002  12/30/1899 4:08:39 AM  12/30/1899 12:27:20 AM   45  26840.0  ...
20003  12/30/1899 4:08:52 AM  12/30/1899 12:27:27 AM   45  20936.0  ...
20004  12/30/1899 4:07:28 AM  12/30/1899 12:26:59 AM   66  23588.0  ...
...                      ...                     ...  ...      ...  ...
26405  12/30/1899 6:46:57 AM  12/30/1899 12:46:44 AM   61  25166.0  ...
26406  12/30/1899 6:54:21 AM  12/30/1899 12:32:03 AM   25  25178.0  ...
26407  12/30/1899 6:54:38 AM  12/30/1899 12:53:11 AM   57  27086.0  ...
26408  12/30/1899 6:56:08 AM  12/30/1899 12:40:34 AM   64  25268.0  ...
26409  12/30/1899 7:41:23 AM  12/30/1899 12:39:36 AM   48  25266.0  ...

       Division Gender                   Half  M/F                      Name  \
20000       378   8442  12/30/1899 2:02:00 AM    F           Draeger, Lori M
20001      4023  11561  12/30/1899 1:54:26 AM    M        Lamendola, Anthony
20002      2185  11562  12/30/1899 2:00:13 AM    M           Connolly, David
20003      1372   8443  12/30/1899 2:02:34 AM    F             Dube, Carolyn
20004       200  11563  12/30/1899 1:54:48 AM    M             Lupo, Francis
...         ...    ...                    ...  ...                       ...
26405       344  11972  12/30/1899 3:23:31 AM    F  Steinbach, Paula Eyvonne
26406      4774  14436  12/30/1899 3:00:26 AM    M        Avelino, Andrew R.
26407       698  11973  12/30/1899 3:36:24 AM    F           Hantel, Johanna
26408      1043  14437  12/30/1899 3:22:30 AM    M              Reilly, Bill
26409      2553  14438  12/30/1899 3:08:16 AM    M             Rigsby, Scott

      Number of Records          Official Time  Overall  \
20000                 1  12/30/1899 4:22:55 AM    20002
20001                 1  12/30/1899 4:22:55 AM    20003
20002                 1  12/30/1899 4:22:55 AM    20004
20003                 1  12/30/1899 4:22:56 AM    20005
20004                 1  12/30/1899 4:22:56 AM    20006
...                 ...                    ...      ...
26405                 1  12/30/1899 7:09:39 AM    26407
26406                 1  12/30/1899 7:16:59 AM    26408
26407                 1  12/30/1899 7:19:37 AM    26409
26408                 1  12/30/1899 7:20:44 AM    26410
26409                 1  12/30/1899 7:58:14 AM    26411

                         Pace State
20000  12/30/1899 12:10:02 AM    WI
20001  12/30/1899 12:10:02 AM    MA
20002  12/30/1899 12:10:02 AM    NY
20003  12/30/1899 12:10:02 AM    MA
20004  12/30/1899 12:10:02 AM    NJ
...                       ...   ...
26405  12/30/1899 12:16:24 AM    CA
26406  12/30/1899 12:16:40 AM    NC
26407  12/30/1899 12:16:47 AM    PA
26408  12/30/1899 12:16:49 AM    NY
26409  12/30/1899 12:18:15 AM    GA

[6410 rows x 26 columns]

### Built-In Methods <br>

<p>These are methods that are frequently used when using Pandas to make your life easier. It is possible to spend a whole week simply exploring the built-in functions supported by DataFrames in Pandas. Here however, we will simply highlight a few ones that might be useful, to give you an idea of what's possible out of the box with Pandas:</p>

##### head()

In [40]:
# DataFrame.head()  -- Accepts integer parameter(gives access to more rows)
df.head()

,10K,15K,20K,25K,30K,35K,40K,5K,Age,Bib,...,Division,Gender,Half,M/F,Name,Number of Records,Official Time,Overall,Pace,State
0,12/30/1899 12:30:28 AM,12/30/1899 12:45:44 AM,12/30/1899 1:01:15 AM,12/30/1899 1:16:59 AM,12/30/1899 1:33:01 AM,12/30/1899 1:48:19 AM,12/30/1899 2:02:53 AM,12/30/1899 12:15:25 AM,24,11.0,...,1,1,12/30/1899 1:04:35 AM,M,"Kirui, Geoffrey",1,12/30/1899 2:09:37 AM,1,12/30/1899 12:04:57 AM,NaN
1,12/30/1899 12:30:27 AM,12/30/1899 12:45:44 AM,12/30/1899 1:01:15 AM,12/30/1899 1:16:59 AM,12/30/1899 1:33:01 AM,12/30/1899 1:48:19 AM,12/30/1899 2:03:14 AM,12/30/1899 12:15:24 AM,30,17.0,...,2,2,12/30/1899 1:04:35 AM,M,"Rupp, Galen",1,12/30/1899 2:09:58 AM,2,12/30/1899 12:04:58 AM,OR
2,12/30/1899 12:30:29 AM,12/30/1899 12:45:44 AM,12/30/1899 1:01:16 AM,12/30/1899 1:17:00 AM,12/30/1899 1:33:01 AM,12/30/1899 1:48:31 AM,12/30/1899 2:03:38 AM,12/30/1899 12:15:25 AM,25,23.0,...,3,3,12/30/1899 1:04:36 AM,M,"Osako, Suguru",1,12/30/1899 2:10:28 AM,3,12/30/1899 12:04:59 AM,NaN
3,12/30/1899 12:30:29 AM,12/30/1899 12:45:44 AM,12/30/1899 1:01:19 AM,12/30/1899 1:17:00 AM,12/30/1899 1:33:01 AM,12/30/1899 1:48:58 AM,12/30/1899 2:04:35 AM,12/30/1899 12:15:25 AM,32,21.0,...,4,4,12/30/1899 1:04:45 AM,M,"Biwott, Shadrack",1,12/30/1899 2:12:08 AM,4,12/30/1899 12:05:03 AM,CA
4,12/30/1899 12:30:28 AM,12/30/1899 12:45:44 AM,12/30/1899 1:01:15 AM,12/30/1899 1:16:59 AM,12/30/1899 1:33:01 AM,12/30/1899 1:48:41 AM,12/30/1899 2:05:00 AM,12/30/1899 12:15:25 AM,31,9.0,...,5,5,12/30/1899 1:04:35 AM,M,"Chebet, Wilson",1,12/30/1899 2:12:35 AM,5,12/30/1899 12:05:04 AM,NaN

##### tail()

In [41]:
# DataFrame.tail()  -- Accepts integer parameter(gives access to more rows)
df.tail()

,10K,15K,20K,25K,30K,35K,40K,5K,Age,Bib,...,Division,Gender,Half,M/F,Name,Number of Records,Official Time,Overall,Pace,State
26405,12/30/1899 1:35:41 AM,12/30/1899 2:23:35 AM,12/30/1899 3:12:44 AM,12/30/1899 4:12:06 AM,12/30/1899 5:03:08 AM,12/30/1899 5:55:18 AM,12/30/1899 6:46:57 AM,12/30/1899 12:46:44 AM,61,25166.0,...,344,11972,12/30/1899 3:23:31 AM,F,"Steinbach, Paula Eyvonne",1,12/30/1899 7:09:39 AM,26407,12/30/1899 12:16:24 AM,CA
26406,12/30/1899 1:05:33 AM,12/30/1899 1:52:17 AM,12/30/1899 2:49:41 AM,12/30/1899 3:50:19 AM,12/30/1899 4:50:01 AM,12/30/1899 5:53:48 AM,12/30/1899 6:54:21 AM,12/30/1899 12:32:03 AM,25,25178.0,...,4774,14436,12/30/1899 3:00:26 AM,M,"Avelino, Andrew R.",1,12/30/1899 7:16:59 AM,26408,12/30/1899 12:16:40 AM,NC
26407,12/30/1899 1:43:36 AM,12/30/1899 2:32:36 AM,NaN,12/30/1899 4:15:21 AM,12/30/1899 5:06:37 AM,12/30/1899 6:00:33 AM,12/30/1899 6:54:38 AM,12/30/1899 12:53:11 AM,57,27086.0,...,698,11973,12/30/1899 3:36:24 AM,F,"Hantel, Johanna",1,12/30/1899 7:19:37 AM,26409,12/30/1899 12:16:47 AM,PA
26408,12/30/1899 1:27:19 AM,12/30/1899 2:17:17 AM,12/30/1899 3:11:40 AM,12/30/1899 4:06:10 AM,12/30/1899 5:07:09 AM,12/30/1899 6:06:07 AM,12/30/1899 6:56:08 AM,12/30/1899 12:40:34 AM,64,25268.0,...,1043,14437,12/30/1899 3:22:30 AM,M,"Reilly, Bill",1,12/30/1899 7:20:44 AM,26410,12/30/1899 12:16:49 AM,NY
26409,12/30/1899 1:17:12 AM,12/30/1899 2:00:10 AM,12/30/1899 2:58:55 AM,12/30/1899 4:27:14 AM,12/30/1899 5:37:13 AM,12/30/1899 6:39:07 AM,12/30/1899 7:41:23 AM,12/30/1899 12:39:36 AM,48,25266.0,...,2553,14438,12/30/1899 3:08:16 AM,M,"Rigsby, Scott",1,12/30/1899 7:58:14 AM,26411,12/30/1899 12:18:15 AM,GA

##### shape

In [44]:
# The dataframe has a shape property, just like a NumPy matrix. 
# print(df.shape) -- DataFrame.shape -- No Parameter


print(df.shape)

(26410, 26)

##### describe() <br>
<p>Probably one of the most important methods to understand...</p>

In [45]:
# Collect summary statistics in one line
# DataFrame.describe() -- Accepts parameters (include, exclude)
df.describe()

,Age,Bib,Overall Time in Seconds,Male Average Times,Females Average Times,Division,Gender,Number of Records,Overall
count,26410.000000,26364.000000,26410.000000,14438.000000,11972.000000,26410.000000,26410.000000,26410.0,26410.000000
mean,42.587732,15795.590844,14283.555358,13734.688392,14945.478283,1588.796706,6660.973230,1.0,13206.260091
std,11.419467,9109.945155,2528.883183,2572.342401,2308.008629,1423.199500,3910.031525,0.0,7624.370496
min,18.000000,3.000000,7777.000000,7777.000000,8512.000000,1.000000,1.000000,1.0,1.000000
25%,34.000000,8042.750000,12499.000000,11847.000000,13321.750000,502.000000,3302.250000,1.0,6604.250000
50%,43.000000,16020.500000,13899.500000,13281.500000,14447.500000,1154.000000,6603.500000,1.0,13206.500000
75%,51.000000,23473.250000,15708.000000,15181.250000,16191.000000,2190.750000,9904.750000,1.0,19808.750000
max,84.000000,31437.000000,28694.000000,28694.000000,26377.000000,5846.000000,14438.000000,1.0,26411.000000

##### sort_values()

In [47]:
# Sort based on many labels, with left-to-right priority
# sorted_data = data.sort_values('ages').reset_index()

# DataFrame.sort_values('key')
df.sort_values('Age')

,10K,15K,20K,25K,30K,35K,40K,5K,Age,Bib,...,Division,Gender,Half,M/F,Name,Number of Records,Official Time,Overall,Pace,State
17735,12/30/1899 12:59:53 AM,12/30/1899 1:28:11 AM,12/30/1899 1:57:49 AM,12/30/1899 2:26:58 AM,12/30/1899 2:56:59 AM,12/30/1899 3:27:37 AM,12/30/1899 3:57:28 AM,12/30/1899 12:30:25 AM,18,26356.0,...,3841,10628,12/30/1899 2:04:00 AM,M,"Fried, Lucas A.",1,12/30/1899 4:10:23 AM,17737,12/30/1899 12:09:33 AM,MA
22938,12/30/1899 1:05:00 AM,12/30/1899 1:37:15 AM,12/30/1899 2:09:43 AM,12/30/1899 2:42:12 AM,12/30/1899 3:17:28 AM,12/30/1899 3:54:05 AM,12/30/1899 4:31:57 AM,12/30/1899 12:32:44 AM,18,28542.0,...,4939,10047,12/30/1899 2:16:44 AM,F,"Blake, Meghan E.",1,12/30/1899 4:47:48 AM,22940,12/30/1899 12:10:59 AM,MA
4735,12/30/1899 12:40:00 AM,12/30/1899 1:02:27 AM,12/30/1899 1:25:33 AM,12/30/1899 1:48:11 AM,12/30/1899 2:12:15 AM,12/30/1899 2:38:13 AM,12/30/1899 3:07:00 AM,12/30/1899 12:20:00 AM,18,4496.0,...,2342,4062,12/30/1899 1:30:22 AM,M,"Moore, Ryan D",1,12/30/1899 3:20:23 AM,4736,12/30/1899 12:07:39 AM,WA
5443,12/30/1899 12:47:10 AM,12/30/1899 1:11:18 AM,12/30/1899 1:34:48 AM,12/30/1899 1:58:19 AM,12/30/1899 2:23:26 AM,12/30/1899 2:48:35 AM,12/30/1899 3:13:12 AM,12/30/1899 12:23:39 AM,18,27556.0,...,2493,4567,12/30/1899 1:39:59 AM,M,"Umphrey, Duncan",1,12/30/1899 3:23:44 AM,5444,12/30/1899 12:07:47 AM,MA
15919,12/30/1899 1:00:41 AM,12/30/1899 1:28:12 AM,12/30/1899 1:56:29 AM,12/30/1899 2:24:39 AM,12/30/1899 2:53:27 AM,12/30/1899 3:22:06 AM,12/30/1899 3:49:29 AM,12/30/1899 12:32:53 AM,18,15125.0,...,3576,6057,12/30/1899 2:02:35 AM,F,"Rucker, Alyssa",1,12/30/1899 4:01:22 AM,15921,12/30/1899 12:09:13 AM,NC
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
21363,12/30/1899 1:00:44 AM,12/30/1899 1:32:17 AM,12/30/1899 2:05:41 AM,12/30/1899 2:40:17 AM,12/30/1899 3:13:39 AM,12/30/1899 3:47:13 AM,12/30/1899 4:19:22 AM,12/30/1899 12:29:28 AM,80,25095.0,...,2,12170,12/30/1899 2:12:45 AM,M,"Miller, Gerald W",1,12/30/1899 4:32:54 AM,21365,12/30/1899 12:10:25 AM,AB
21983,12/30/1899 1:01:15 AM,12/30/1899 1:32:03 AM,12/30/1899 2:04:14 AM,12/30/1899 2:37:57 AM,12/30/1899 3:12:44 AM,12/30/1899 3:49:06 AM,12/30/1899 4:23:05 AM,12/30/1899 12:30:30 AM,81,25123.0,...,3,12462,12/30/1899 2:11:08 AM,M,"Shimojou, Michiharu",1,12/30/1899 4:38:11 AM,21985,12/30/1899 12:10:37 AM,NaN
25469,12/30/1899 1:00:46 AM,12/30/1899 1:33:42 AM,12/30/1899 2:06:08 AM,12/30/1899 2:41:02 AM,12/30/1899 3:22:55 AM,12/30/1899 4:10:04 AM,12/30/1899 5:03:05 AM,12/30/1899 12:29:09 AM,81,25110.0,...,6,14041,12/30/1899 2:13:23 AM,M,"Roake, Samuel C.",1,12/30/1899 5:29:49 AM,25471,12/30/1899 12:12:35 AM,CA
22619,12/30/1899 12:57:36 AM,12/30/1899 1:27:21 AM,12/30/1899 1:59:56 AM,12/30/1899 2:34:36 AM,12/30/1899 3:11:06 AM,12/30/1899 3:49:05 AM,12/30/1899 4:27:33 AM,12/30/1899 12:28:30 AM,83,25134.0,...,4,12748,12/30/1899 2:07:10 AM,M,"Yoo, Jack",1,12/30/1899 4:44:39 AM,22621,12/30/1899 12:10:52 AM,IL
26340,12/30/1899 1:17:26 AM,12/30/1899 1:59:14 AM,12/30/1899 2:42:00 AM,12/30/1899 3:25:20 AM,12/30/1899 4:12:04 AM,12/30/1899 4:58:00 AM,12/30/1899 5:43:44 AM,12/30/1899 12:36:41 AM,84,25269.0,...,1,11942,12/30/1899 2:51:22 AM,F,"Beiers, Katherine",1,12/30/1899 6:04:07 AM,26342,12/30/1899 12:13:54 AM,CA

##### .columns

In [51]:
# will show all cols headers
# DataFrame.columns -- has no parameters


# Keys brings back the 'index' of whatever data type we are working with 
# Getting the Index object from DataFrame
column_headers = df.columns
print("Column headers:", column_headers)

Column headers: Index(['10K', '15K', '20K', '25K', '30K', '35K', '40K', '5K', 'Age', 'Bib',
       'Overall Time in Seconds', 'Citizenship', 'Male Average Times',
       'Females Average Times', 'City', 'Country', 'Division', 'Gender',
       'Half', 'M/F', 'Name', 'Number of Records', 'Official Time', 'Overall',
       'Pace', 'State'],
      dtype='object')

### In-Class Exercise #2 - Describe & Sort Boston Red Sox Hitting Data <br>
<p>Take the data that you read in earlier from the Red Sox csv's and use the describe method to understand the data better. Compare the two years and decide which team is having the better year. Then sort the values based on Batting Average.</p>

In [ ]:
file_path = ''

df = pd.read_csv(file_path)

print(df.head())

### Filtration <br>
<p>Let's look at how to filter dataframes for rows that fulfill a specific conditon.</p>

##### Conditionals

In [7]:
data = {
    'Name': ['John', 'Alice', 'Bob', 'Emma', 'Sam'],
    'Age': [28, 24, 35, 30, 40],
    'Salary': [50000, 60000, 45000, 70000, 55000]
}

df = pd.DataFrame(data)
filtered_df = df[df['Age'] > 30]

##### Subsetting

In [8]:

subset_df = df[['Name', 'Salary']]

### Column Transformations <br>
<p>Rarely, if ever, will the columns in the original raw dataframe read from CSV or database table be the ones you actually need for your analysis. You will spend lots of time constantly transforming columns or groups of columns using general computational operations to produce new ones that are functions of the old ones. Pandas has full support for this: Consider the following dataframe containing membership term and renewal number for a group of customers:</p>

In [13]:
data = {
    'CustomerID': [1, 2, 3, 4, 5],
    'MembershipTerm': [12, 24, 36, 12, 24],  # in months
    'RenewalNumber': [1, 2, 1, 3, 4]          # number of times renewed
}

df = pd.DataFrame(data)
df['TotalDuration'] = df['MembershipTerm'] * df['RenewalNumber']
print(df)

   CustomerID  MembershipTerm  RenewalNumber  TotalDuration
0           1              12              1             12
1           2              24              2             48
2           3              36              1             36
3           4              12              3             36
4           5              24              4             96

##### Generating a New Column w/Data

In [16]:
# DataFrame['key'] = Some Calculation from our DataFrame Columns
df['IsLongTerm'] = df['TotalDuration'] > 36
print(df)

   CustomerID  MembershipTerm  RenewalNumber  TotalDuration  IsLongTerm
0           1              12              1             12       False
1           2              24              2             48        True
2           3              36              1             36       False
3           4              12              3             36       False
4           5              24              4             96        True

##### User Defined Function

<p>If what you want to do to a column that can't be represented by simple mathematical operations, you can write your own $\textit{user defined function}$ with the full customizability available in Python and any external Python packages, then map it directly onto a column. Let's add some ages to our customer dataframe, and then classify them into our custom defined grouping scheme:</p>

In [19]:
# use .apply to map over dataframe

# Create a new column for ages
import pandas as pd
import numpy as np

# Sample DataFrame
data = {
    'CustomerID': [1, 2, 3, 4, 5],
    'MembershipTerm': [12, 24, 36, 12, 24],  
    'RenewalNumber': [1, 2, 1, 3, 4]         
}

df = pd.DataFrame(data)


df['Age'] = np.random.randint(18, 70, size=len(df))

# customers['ages'] = np.random.randint(18,70,10)

# User defined function
def make_age_groups(age):
    if age < 30:
        return 'Young Adult'
    elif 30 <= age < 50:
        return 'Middle-Aged'
    else:
        return 'Senior'

df['AgeGroup'] = df['Age'].apply(make_age_groups)
 
# print(make_age_groups)
print(df)

   CustomerID  MembershipTerm  RenewalNumber  Age     AgeGroup
0           1              12              1   41  Middle-Aged
1           2              24              2   23  Young Adult
2           3              36              1   19  Young Adult
3           4              12              3   27  Young Adult
4           5              24              4   58       Senior

<p>As a last example I'll show here how you would use a lambda function to create a UDF that depends on $\textit{more than one}$ column:</p>

<li>UDF = User Defined Function</li>

In [23]:
#Axis for apply can only be 1 or 0 -- 1 being the X axis 0 being the Y axis
import pandas as pd
import numpy as np


data = {
    'CustomerID': [1, 2, 3, 4, 5],
    'MembershipTerm': [12, 24, 36, 12, 24],  
    'RenewalNumber': [1, 2, 1, 3, 4],       
    'Age': np.random.randint(18, 70, size=5)
}

df = pd.DataFrame(data)


df['TotalDuration'] = df['MembershipTerm'] * df['RenewalNumber']


df['CustomerCategory'] = df.apply(
    lambda row: (
        'Young Long-Term' if row['Age'] < 30 and row['TotalDuration'] > 36 else
        'Middle-Aged Short-Term' if 30 <= row['Age'] < 50 and row['TotalDuration'] <= 36 else
        'Senior Long-Term' if row['Age'] >= 50 and row['TotalDuration'] > 36 else
        'Other'
    ),
    axis=1
)
print(df)

   CustomerID  MembershipTerm  RenewalNumber  Age  TotalDuration  \
0           1              12              1   67             12
1           2              24              2   63             48
2           3              36              1   64             36
3           4              12              3   57             36
4           5              24              4   43             96

   CustomerCategory
0             Other
1  Senior Long-Term
2             Other
3             Other
4             Other

### In-Class Exercise #3 - Create Your Own UDF <br>
<p>Using the Boston Red Sox data, create your own UDF which creates a new column called 'All-Star' and puts every player with either a batting average over .280 or an on base percentage of over .360 with a result of 'Yes' in the column and 'No' if not.</p>

In [29]:
"""
    Name  BA OBP AllStar
    --------------------
    Name .233 .360 Yes
    Name .150 .288 No
"""
import pandas as pd


file_path = r"C:\Users\Zaur\OneDrive\Desktop\Disk\2023Nazrin\Bootcamp_coding temple\Python Advanced\Python advanced_task\Numpy\redsox_2018.txt"
df = pd.read_csv(file_path)


def classify_all_star(row):
    if row['BA'] > 0.280 or row['OBP'] > 0.360:
        return 'Yes'
    else:
        return 'No'


df['All-Star'] = df.apply(classify_all_star, axis=1)


print(df[['Name', 'BA', 'OBP', 'All-Star']])

                  Name     BA    OBP All-Star
0           Sandy Leon  0.177  0.232       No
1       Mitch Moreland  0.245  0.325       No
2        Eduardo Nunez  0.265  0.289       No
3      Xander Bogaerts  0.288  0.360      Yes
4        Rafael Devers  0.240  0.298       No
5    Andrew Benintendi  0.290  0.366      Yes
6   Jackie Bradley Jr.  0.234  0.314       No
7         Mookie Betts  0.346  0.438      Yes
8        J.D. Martinez  0.330  0.402      Yes
9           Brock Holt  0.277  0.362      Yes
10   Christian Vazquez  0.207  0.257       No
11       Blake Swihart  0.229  0.285       No
12      Hanley Ramirez  0.254  0.313       No
13        Steve Pearce  0.279  0.394      Yes
14         Ian Kinsler  0.242  0.294       No
15         Tzu-Wei Lin  0.246  0.329       No
16          Sam Travis  0.222  0.263       No
17    Brandon Phillips  0.130  0.259       No
18      Dustin Pedroia  0.091  0.231       No
19          Dan Butler  0.167  0.143       No

### Aggregations <br>
<p>The raw data plus some transformations is generally only half the story. Your objective is to extract actual insights and actionable conclusions from the data, and that means reducing it from potentially billions of rows to some summary statistics via aggregation functions.</p>

##### groupby() <br>
<p>The .groupby() function is in some ways a 'master' aggregation.</p> 

<p>Data tables will usually reserve one column as a primary key - that is, a column for which each row has a unique value. This is to facilitate access to the exact rows of a data table that a user wants to view. The other columns will often have repeated values, such as the age groups in the above examples. We can use these columns to explore the data using the Pandas API:</p>

In [35]:
# also introducing .count() here, exact same as to how it's used in SQL

# Using the groupby with the column intact as a column/key
# customers.groupby('age_group', as_index = False).count()[['customer_id','age_group']]

import pandas as pd

# Example DataFrame
data = {
    'CustomerID': [1, 2, 3, 4, 5, 6, 7],
    'AgeGroup': ['Young', 'Young', 'Middle-Aged', 'Middle-Aged', 'Senior', 'Senior', 'Young'],
    'PurchaseAmount': [100, 150, 200, 250, 300, 350, 400]
}

df = pd.DataFrame(data)
grouped_counts = df.groupby('AgeGroup', as_index=False).count()[['CustomerID', 'AgeGroup']]
print(grouped_counts)

   CustomerID     AgeGroup
0           2  Middle-Aged
1           2       Senior
2           3        Young

##### Type of groupby()

<p>The result is a new dataframe, the columns of which all contain the counts of the grouped field. Notice the type of a grouped dataframe:</p>

In [37]:

print(type(grouped_counts))

<class 'pandas.core.frame.DataFrame'>

<p>This is because simply grouping data doesn't quite make sense without an aggregation function like count() to pair with. In this case, we're counting occurances of the grouped field, but that's not all we can do. We can take averages, standard deviations, mins, maxes and much more! Let's see how this works a bit more:</p>

##### mean()

In [38]:
grouped_mean = df.groupby('AgeGroup', as_index=False)['PurchaseAmount'].mean()
print(grouped_mean)

      AgeGroup  PurchaseAmount
0  Middle-Aged      225.000000
1       Senior      325.000000
2        Young      216.666667

##### groupby() w/Multiple Columns

<p>We end up with the average age of the groups in the last column, the average tenure in the tenure column, and so on and so forth. You can even split the groups more finely by passing a list of columns to group by:</p>

In [40]:
data = {
    'CustomerID': [1, 2, 3, 4, 5, 6, 7],
    'AgeGroup': ['Young', 'Young', 'Middle-Aged', 'Middle-Aged', 'Senior', 'Senior', 'Young'],
    'CustomerType': ['Regular', 'Premium', 'Regular', 'Premium', 'Regular', 'Premium', 'Regular'],
    'Age': [25, 30, 45, 50, 65, 70, 28],
    'Tenure': [2, 3, 4, 5, 6, 7, 1]
}

df = pd.DataFrame(data)
grouped_mean = df.groupby(['AgeGroup', 'CustomerType'], as_index=False).mean()
print(grouped_mean)

      AgeGroup CustomerType  CustomerID   Age  Tenure
0  Middle-Aged      Premium         4.0  50.0     5.0
1  Middle-Aged      Regular         3.0  45.0     4.0
2       Senior      Premium         6.0  70.0     7.0
3       Senior      Regular         5.0  65.0     6.0
4        Young      Premium         2.0  30.0     3.0
5        Young      Regular         4.0  26.5     1.5

##### drop_duplicates()

<p>Drops all duplicates from the current dataframe</p>

In [41]:
df.drop_duplicates(subset=None, keep='first', inplace=False)

   CustomerID     AgeGroup CustomerType  Age  Tenure
0           1        Young      Regular   25       2
1           2        Young      Premium   30       3
2           3  Middle-Aged      Regular   45       4
3           4  Middle-Aged      Premium   50       5
4           5       Senior      Regular   65       6
5           6       Senior      Premium   70       7
6           7        Young      Regular   28       1

In [42]:
df_no_duplicates = df.drop_duplicates()
print(df_no_duplicates)

   CustomerID     AgeGroup CustomerType  Age  Tenure
0           1        Young      Regular   25       2
1           2        Young      Premium   30       3
2           3  Middle-Aged      Regular   45       4
3           4  Middle-Aged      Premium   50       5
4           5       Senior      Regular   65       6
5           6       Senior      Premium   70       7
6           7        Young      Regular   28       1

<p>Thus the groupby operation allows you to rapidly make summary observations about the state of your entire dataset at flexible granularity. In one line above, we actually did something very complicated - that's the power of the dataframe. In fact, the process often consists of several iterative groupby operations, each revealing greater insight than the last - if you don't know where to start with a dataset, try a bunch of groupbys!</p>

### Homework Excersise #1 - Find the Total Number of Runs and RBIs for the Red Sox <br>
<p>Get total number of home runs and rbi's</p>

In [43]:
# step 1: Add a new column with the key 'Team' and all column values should be 'BOS'
import pandas as pd

data = {
    'Year': [2017, 2017, 2018, 2018],
    'Player': ['Player1', 'Player2', 'Player1', 'Player2'],
    'Home Runs': [30, 25, 35, 20],
    'RBIs': [90, 80, 95, 85]
}

df = pd.DataFrame(data)
df['Team'] = 'BOS'

# step 2: Group by the 'Team' column and get total home runs and rbi's
result = df.groupby(['Team', 'Year']).agg({'Home Runs': 'sum', 'RBIs': 'sum'}).reset_index()
result_bos = result[result['Team'] == 'BOS']
# Produce data for both 2017 and 2018 (ie print both seperated by a newline character \n)
print("2017 Totals:\n", result_bos[result_bos['Year'] == 2017], "\n")
print("2018 Totals:\n", result_bos[result_bos['Year'] == 2018])


"""
TEAM    HR   RBI
----------------
BOS     144  538
"""

2017 Totals:
   Team  Year  Home Runs  RBIs
0  BOS  2017         55   170

2018 Totals:
   Team  Year  Home Runs  RBIs
1  BOS  2018         55   180

'\nTEAM    HR   RBI\n----------------\nBOS     144  538\n'

## Find the average age of runners in the 2017 Boston Marathon

In [45]:
import pandas as pd
file_path = r"C:\Users\Zaur\OneDrive\Desktop\Disk\2023Nazrin\Bootcamp_coding temple\Python Advanced\Python advanced_task\Pandas_Homework1\boston_marathon2017_edited - boston_marathon2017_edited (1).csv"
df = pd.read_csv(file_path)
average_age = df['Age'].mean()

print(f"The average age of runners in the 2017 Boston Marathon is {average_age:.2f} years.")

The average age of runners in the 2017 Boston Marathon is 42.59 years.